app/views/books/show.html.erb


  <p><%= pluralize(@book.reviews.size, 'Review') %></p>
  <ol>
    <% @book.reviews.limit(3).each do |review| %>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 3]]