app/controllers/books_controller.rb

  def index
    #fail
    case params[:scope]
    when "past"
      @books = Book.past
    when "free"
      @books = Book.free
    when "recent"
      @books = Book.recent(4)
    else
      @books = Book.all
---
SELECT "books".* FROM "books"

  def show
    @likers = @book.likes
    @categories = @book.categories
    if current_user
      @current_like = current_user.likes.find_by(book_id: @book.id)
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."book_id" = ?  [["book_id", 1]]

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "book_image_name" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["book_image_name", "the_hobbit.jpg"], ["updated_at", "2018-09-23 02:35:27.909781"], ["id", 1]]

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "author", "description", "released_on", "book_image_name", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def set_book
    @book = Book.find_by!(slug: params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."slug" = ? LIMIT ?  [["slug", "the-hobbit"], ["LIMIT", 1]]