app/controllers/likes_controller.rb

	def create
		@book = Book.find_by!(slug: params[:book_id])
		@book.likes.create!(user: current_user)
---
INSERT INTO "likes" ("book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 2], ["user_id", 1], ["created_at", "2018-09-25 00:14:05.883801"], ["updated_at", "2018-09-25 00:14:05.883801"]]

	def destroy
		like = current_user.likes.find(params[:id])
		like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]