app/controllers/reviews_controller.rb

	def create
		@review = @book.reviews.new(review_params)
		@review.user = current_user
		if @review.save
---
INSERT INTO "reviews" ("name", "stars", "comment", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Drizzt"], ["stars", 5], ["comment", "TOTALLY AWESOME!!!"], ["book_id", 1], ["created_at", "2018-09-23 04:19:06.039786"], ["updated_at", "2018-09-23 04:19:06.039786"]]

	def update
		@review = Review.find(params[:id])
		if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "AWESOME!!! (2X)"], ["updated_at", "2018-09-23 05:18:30.693963"], ["id", 1]]

	def set_book
		@book = Book.find_by!(slug: params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."slug" = ? LIMIT ?  [["slug", "7-hitchhiker-s-guide-to-the-galaxy"], ["LIMIT", 1]]